#########
#运算符有+，-，*，/，//（整除），%，**（幂）
#########
a =10 
b=3
c=5
d=True
print("两个数字分别是%s和%s"%(a,b))
print("加法的结果是：" + str(a+b))
print("减法的结果是：" + str(a-b))
print("乘法的结果是：" + str(a*b))
print("除法的结果是：" + str(a/b))
print("整除的结果是：" + str(a//b))
print("取余的结果是：" + str(a%b))
print("幂运算的结果是：" + str(a**b))
#########
#运算符有优先级，为** --> * / //  %  --> + -
#########
print("0.1 + 10 / 4**2 = ",0.1 + 10 / 4**2)

x = input("请输入第一个数：")#输入为字符串
y = input("请输入第二个数：")
print(f"两个数相加的结果是:{int(x)+int(y)}")
print(f"两个数相减的结果是:{int(x)-int(y)}")

#########
#赋值运算符，有= += -= *= /= %= //= **=
#########
a = 10

print("两个数字分别是 %s 和 %s" % (a, 2))

a = 10
a += 2
print("加法赋值结果是：", a)

a = 10
a -= 2
print("减法赋值结果是：", a)

a = 10
a *= 2
print("乘法赋值结果是：", a)

a = 10
a /= 2
print("除法赋值结果是：", a)

a = 10
a //= 2
print("整除结果是：", a)

a = 10
a %= 2
print("取余结果是：", a)

a = 10
b = 3
print("幂运算结果是：", a ** b)